<template>
  <b-modal id="modal-contract" hide-header hide-footer centered>
    <div class="modal__wrapper contract">
      <button
        class="modal__close"
        @click="$bvModal.hide('modal-contract')"
      >
        <img src="img/modal-close.png" alt />
      </button>
      <div class="contract">
        <div class="contract__wrapper">
          <!-- <div class="contract__head">
            <div class="contract__head-left">
              <img src="img/tarif-modal.png" alt />
              <div class="contract__head-info">
                <p class="contract__head-name">Ковальский Виджет для рекламы ВКонтакте</p>
                <span class="contract__head-date">18 июня 2020 в 11:39</span>
              </div>
            </div>
            <div class="contract__head-right">
              <button class="gen-btn">Подписаться</button>
            </div>
          </div> -->
          <div class="contract__content">
            <div class="contract__content-top">
              <h2>Публичный договор-оферта</h2>
              <p>
                Настоящий договор является публичной офертой именуемого
                в дальнейшем Исполнитель, в соответствии со ст. 437 ГК РФ
              </p>
            </div>
            <h3>1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h3>
            <ul>
              <li>
                <strong>Заказчик</strong>
                — физическое или юридическое лицо, индивидуальный предприниматель, принявшее (акцептовавшее) настоящую оферту. В соответствии с п. 3 ст. 438 ГК РФ акцептом оферты является, в том числе, оплата услуг Исполнителя.
              </li>
              <li>
                <strong>Стороны</strong>
                — совместное наименование Исполнителя и Заказчика для целей настоящего договора.
              </li>
              <li>
                <strong>Услуга</strong>
                — предоставление Пользователю возможности использования веб-сервиса и его функций путем удаленного подключения по сети интернет в объемах и в течение сроков, предусмотренных тарифом.
              </li>
              <li>
                <strong>Пользователь</strong>
                — физическое лицо, зарегистрированное в сети Вконтакте и имеющее действующую учетную запись в указанной сети, непосредственно пользующееся услугой от имени и по поручению Заказчика и по согласованию с Исполнителем.
              </li>
              <li>
                <strong>Веб-сервис</strong>
                программное обеспечение «Ковальский Виджет», расположенное в сети интернет по адресу
                <a href="https://mykowalski.ru/" target="_blank">mykowalski.ru</a>
                , а также иное программное обеспечение, которое может быть предусмотрено Тарифом.
              </li>
              <li>
                <strong>Учетная запись</strong>
                — совокупность данных авторизации и иной информации Пользователя, используемой для доступа к сетям Вконтакте, расположенных в сети интернет по адресам http://vk.com или иным адресам, используемых указанными ресурсами.
              </li>
              <li>
                <strong>Тариф</strong>
                — перечень и спецификация предоставляемых Исполнителем услуг (их объем, характеристика, сроки предоставления, стоимость и т.д.), опубликованные на информационных ресурсах.
              </li>
              <li>
                <strong>Информационные ресурсы</strong>
                — интернет-сайт Исполнителя
                <a href="https://mykowalski.ru/" target="_blank">mykowalski.ru</a>
                и сообщество ВКонтакте
                <a href="https://vk.com/kowalskiwidget" target="_blank">https://vk.com/kowalskiwidget</a>
              </li>
            </ul>
            <h3>2. ОБЩИЕ ПОЛОЖЕНИЯ</h3>
            <ul>
              <li>
                2.1. Исполнитель обязуется предоставлять, а Заказчик - своевременно и в полном объеме оплачивать услуги, предусмотренные настоящим
                Договором.
              </li>
              <li>2.2. В услугу не входит настройка программного или аппаратного обеспечения пользователя. Консультации по вопросам функционирования веб-сервиса осуществляются службой поддержки на условиях, опубликованных на информационных ресурсах.</li>
            </ul>
            <h3>3. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h3>
            <ul>
              <li>3.1. Исполнитель обязуется качественно, своевременно и в полном объеме предоставлять услуги Заказчику.</li>
              <li>3.2. Исполнитель оставляет за собой право на безвозмездной основе опубликовать в информационных ресурсах, принадлежащих исполнителю, или в иных сетевых ресурсах публичную информацию о группе, скриншот группы с размещенной в ней продуктом (виджетом) с целью информирования третьих лиц о возможностях продукта (виджета) и информации о его использовании.</li>
            </ul>
            <h3>4. СТОИМОСТЬ УСЛУГ И ПОРЯДОК ОПЛАТЫ</h3>
            <ul>
              <li>4.1. Стоимость Услуг определяется на момент их оплаты Заказчиком согласно выбранному тарифу.</li>
              <li>4.2. Услуги предоставляются на условиях предоплаты, которая осуществляется Заказчиком путем перечисления средств на расчетный счет Исполнителя (для Заказчиков - юридических лиц или индивидуальных предпринимателей) или другими способами, опубликованными на информационных ресурсах (для Заказчиков - физических лиц).</li>
            </ul>
            <h3>5. ПОРЯДОК СДАЧИ-ПРИЕМКИ ПРЕДОСТАВЛЕННЫХ УСЛУГ</h3>
            <ul>
              <li>5.1. Услуги, оказанные Исполнителем, будут считаться принятыми в полном объеме при отсутствии письменных возражений или претензий со стороны Заказчика спустя 10 дней после окончания оплаченного в соответствии с Тарифом периода.</li>
              <li>5.2. В случае несоблюдения Заказчиком сроков, указанных в п.5.1. Договора, Услуги также считаются принятыми Заказчиком в полном объеме и без замечаний.</li>
            </ul>
            <h3>7. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h3>
            <ul>
              <li>7.1. Договор вступает в силу в момент оплаты Заказчиком Услуг согласно выбранного им Тарифа и действует в течение всего срока, когда Исполнитель предоставляет Услуги, а Заказчик их оплачивает, но в любом случае до полного выполнения Сторонами своих обязательств по Договору.</li>
              <li>7.2. Действие Договора прекращается в случае расторжения Договора по соглашению Сторон или по инициативе одной из Сторон в случае грубого и/или систематического нарушения другой Стороной условий Договора.Услуг.</li>
            </ul>
            <h3>8. РЕКВИЗИТЫ</h3>
            <ul>
              <li>ИП Романов Сергей Евгеневич</li>
              <li>ИНН 344691287230</li>
              <li>ОГРН 319784700029340</li>
              <li>Расчетный счет 40802810332230002232</li>
              <li>Банк АО «Альфа-Банк»</li>
              <li>Корр. счет Банка 30101810600000000786</li>
              <li>ИНН Банка 344691287230</li>
              <li>БИК Банка 044030786</li>
            </ul>
            <!-- <button class="gen-btn">
              <img src="img/tarif-heart.png" alt />
              <span>Нравится</span>
              <span>24</span>
            </button> -->
          </div>
        </div>
        <div class="contract__bottom">
          <a href="https://vk.com/kowalskiwidget" target="_blank" class="contract__bottom-link">Перейти к сообществу Ковальский Виджет для рекламы ВКонтакте</a>
          <!-- <p class="contract__bottom-text">1 856 просмотров</p> -->
        </div>
      </div>
    </div>
  </b-modal>
</template>
